print('Задача 1. Конвертация')

# При покупках за рубежом
# с помощью карты банки делают конвертацию через промежуточную валюту.

# Например,
# если купить что-то в евро,
# то сначала эта сумма конвертируется в доллары, а уже потом - в рубли.
#
# Напишите программу,
# которая получает на вход стоимость покупки в евро,
# затем выводит ответ в рублях.
#
# Мы живём в альтернативной реальности,
# где 1 евро = 1.25 доллара, а 1 доллар = 60.87 рублей.

amount_euro = float(input("Введите сумму покупки в евро: "))
#Конвертируем сумму покупки из евро в доллары и потом полученную сумму конвертируем в рубли
#И округляем ответ до двух знаков после запятой
amount_rub = round((amount_euro * 1.25) * 60.87, 2)

print("Стоимость покупки в рублях:", amount_rub)
